Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/OmegaT_ESP32-level2.tmx
Source language: en_us
Languages: it_it

source: Whenever someone visits the main page of your web server, the ESP32 will immediately read the current temperature from the DS18B20 sensor and send back a complete web page that shows the temperature in both Celsius and Fahrenheit.
it_it: Ogni volta che qualcuno visita la pagina principale del server web, l'ESP32 leggerà immediatamente la temperatura attuale dal sensore DS18B20 e invierà una pagina web completa che mostra la temperatura sia in gradi Celsius che Fahrenheit.

source: Where ``~/Documents/Arduino`` represents your sketch book location as per "Arduino" > "Preferences" > "Sketchbook location" (in the IDE once started).
it_it: Dove ``~/Documents/Arduino`` rappresenta la posizione dello sketchbook, come indicato in "Arduino" > "Preferences" > "Sketchbook location" (nell'IDE una volta avviato).

source: Whereas no actions are taken for the WS_EVT_PONG and WS_EVT_ERROR event types, though they could be further developed if needed.
it_it: Per i tipi di evento WS_EVT_PONG e WS_EVT_ERROR , invece, non viene intrapresa alcuna azione, sebbene potrebbero essere ulteriormente sviluppati se necessario.

source: Which ESP32 GPIOs are safe to use?
it_it: Quali GPIO ESP32 sono sicuri da usare?

source: Which One Should You Buy?
it_it: Quale acquistare?

source: While Bluetooth specifications define how the technology works, profiles define how it is used.
it_it: Mentre le specifiche Bluetooth definiscono il funzionamento della tecnologia, i profili ne definiscono il suo utilizzo.

source: While ESP-IDF supports configuration of various compile-time options (known as "Kconfig options" or "sdkconfig options") via a "menuconfig" tool, this feature is not available in Arduino IDE.
it_it: Sebbene ESP-IDF supporti la configurazione di varie opzioni in fase di compilazione (note come "opzioni Kconfig" o "opzioni sdkconfig") tramite lo strumento "menuconfig", questa funzionalità non è disponibile nell'IDE Arduino.

source: While auto-refreshing the whole page works, it’s not the most efficient method-especially when only a small piece of information, like a temperature reading, is changing.
it_it: Sebbene l'aggiornamento automatico dell'intera pagina funzioni, non è il metodo più efficiente, soprattutto quando cambia solo una piccola informazione, come la lettura della temperatura.

source: While it may not be the ideal platform for working with the ESP32, it is a program that most people are already familiar with, which makes getting started much easier.
it_it: Sebbene non sia la piattaforma ideale per lavorare con l'ESP32, è un programma con cui la maggior parte delle persone ha già familiarità, il che semplifica notevolmente l'inizio.

source: While the ESP32 is trying to connect, we check its connection status using WiFi.status() .
it_it: Mentre l'ESP32 tenta di connettersi, controlliamo il suo stato di connessione utilizzando WiFi.status() .

source: While these two protocols share many important things such as architecture, and both operate in 2.4 GHz ISM (Industrial, Scientific, and Medical) band, they’re quite different from each other.
it_it: Sebbene questi due protocolli condividano molti aspetti importanti, come l'architettura, ed entrambi operino nella banda ISM (Industrial, Scientific and Medical) a 2,4 GHz, sono piuttosto diversi tra loro.

source: While they all function similarly, some boards may be better suited to specific projects than others.
it_it: Sebbene funzionino tutte in modo simile, alcune schede potrebbero essere più adatte a progetti specifici rispetto ad altre.

source: While this might seem confusing at first, it’s actually a very organized system.
it_it: Sebbene a prima vista possa sembrare complicato, in realtà si tratta di un sistema molto organizzato.

source: While this project is quite basic, it can serve as the basis for more practical experiments and projects.
it_it: Sebbene questo progetto sia piuttosto elementare, può servire come base per esperimenti e progetti più pratici.

source: Wi-Fi 802.11b/g/n (802.11n up to 150 Mbps)
it_it: Wi-Fi 802.11b/g/n (802.11n fino a 150 Mbps)

source: Wi-Fi Capabilities
it_it: Funzionalità Wi-Fi

source: WiFi Direct is simpler to set up and has much faster data transfer speeds than Bluetooth.
it_it: WiFi Direct è più semplice da configurare e offre velocità di trasferimento dati molto più elevate rispetto al Bluetooth.

source: WiFi.h : offers ESP32-specific WiFi methods we use to connect to the network.
it_it: WiFi.h : offre metodi WiFi specifici per ESP32 che utilizziamo per connetterci alla rete.

source: Windows (manual installation)
it_it: Windows (installazione manuale)

source: Winner: ESP32
it_it: Vincitore: ESP32

source: Winner: ESP8266
it_it: Vincitore: ESP8266

source: Winner: Tie
it_it: Vincitore: Ex aequo

source: Wireless Connectivity
it_it: Connettività Wireless

source: Wiring
it_it: Cablaggio

source: Wiring LEDs to an ESP32
it_it: Collegamento dei LED a un ESP32

source: Wiring the Circuit
it_it: Cablaggio del Circuito

source: With its multiple power modes and dynamic power scaling, ESP32 achieves ultra-low power consumption, making it ideal for use in mobile devices, wearable electronics and IoT applications.
it_it: Grazie alle sue modalità multiple di alimentazione e al ridimensionamento dinamico della potenza, l'ESP32 garantisce un consumo energetico estremamente basso, rendendolo ideale per l'uso in dispositivi mobili, dispositivi elettronici indossabili e applicazioni IoT.

source: With the IP address it assigns itself, your ESP32 can serve web pages directly to all the devices that have connected to its newly created network.
it_it: Con l'indirizzo IP che si assegna, l'ESP32 può fornire pagine web direttamente a tutti i dispositivi che si sono connessi alla nuova rete creata.

source: With this, it can actively listen for connections in the background, parse incoming requests, and trigger the appropriate event handler.
it_it: In questo modo, può ascoltare attivamente le connessioni in background, analizzare le richieste in arrivo e attivare il gestore di eventi appropriato.

source: Within this function, there’s a call to request->send_P(...) .
it_it: All'interno di questa funzione, c'è una chiamata a request->send_P(...) .

source: Xtensa® Dual-Core 32-bit LX6
it_it: Xtensa® Dual-Core LX6 a 32 bit

source: YES
it_it: Sì

source: Yes
it_it: Sì

source: You are free to change the name to whatever you want.
it_it: È possibile modificare il nome come si desidera.

source: You can add multiple URLs, separating them with commas.
it_it: Si possono aggiungere più URL, separandoli con virgole.

source: You can also use another module if it meets Flash chip size of the sketch
it_it: È possibile utilizzare anche un altro modulo, se compatibile con le dimensioni del chip Flash dello sketch.

source: You can check out the implementation file for this class here .
it_it: È possibile consultare il file di implementazione per questa classe qui .

source: You can choose any of them to load the sketch into your IDE and start experimenting with it.
it_it: Se ne può scegliere uno qualsiasi per caricarlo nell'IDE e iniziare a sperimentarlo.

source: You can choose any of them to load the sketch into your IDE.
it_it: Si può sceglierne uno qualsiasi per caricare lo sketch nell'IDE.

source: You can do this by adding a special tag.
it_it: Lo si può fare aggiungendo un tag speciale .

source: You can find a lot of useful content on the Internet.
it_it: Si possono trovare molti contenuti utili su Internet.

source: You can find more Bluetooth SIG-defined services here .
it_it: Si possono trovare altri servizi definiti da Bluetooth SIG qui .

source: You can find this example under File > Examples > WiFi > WiFiScan.
it_it: Su può trovare questo esempio in "File > Esempi > ​​WiFi > WiFiScan".

source: You can go with Espruino (JavaScript SDK and firmware closely emulating Node.js), Mongoose OS (an operating system for IoT devices that is recommended by Espressif Systems and Google Cloud IoT), MicroPython (implementation of Python 3 for microcontrollers), an SDK provided by Espressif, or one of the platforms listed on WiKiPedia .
it_it: Si può usare Espruino (SDK JavaScript e firmware che emulano Node.js), Mongoose OS (un sistema operativo per dispositivi IoT consigliato da Espressif Systems e Google Cloud IoT), MicroPython (implementazione di Python 3 per microcontrollori), un SDK fornito da Espressif o una delle piattaforme elencate su WiKiPedia .

source: You can go with:
it_it: Si può scegliere tra:

source: You can go with: Arduino IDE - intended for those who are familiar with Arduino...
it_it: Si può usare: Arduino IDE - pensato per chi ha familiarità con Arduino...

source: You can go with: Arduino IDE - intended for those who are familiar with ArduinoEspruino...
it_it: Si può usare: l'IDE di Arduino - pensato per chi ha familiarità con ArduinoEspruino...

source: You can make a touch pad by attaching any conductive object to these pins, such as aluminum foil, conductive cloth, conductive paint, and so on.
it_it: È possibile realizzare un touchpad collegando qualsiasi oggetto conduttivo a questi pin, come un foglio di alluminio, un panno conduttivo, una vernice conduttiva e così via.

source: You can now begin writing code for your ESP32 in the Arduino IDE.
it_it: Ora si può iniziare a scrivere il codice per l'ESP32 nell'IDE Arduino.

source: You can resolve this issue by following the steps outlined below.
it_it: Questo problema si risolve seguendo i passaggi descritti di seguito.

source: You can use the Arduino IDE, MicroPython, Espruino, Espressif SDK, or one of the platforms listed on WikiPedia .
it_it: È possibile utilizzare l'IDE Arduino, MicroPython, Espruino, Espressif SDK o una delle piattaforme elencate su WikiPedia .

source: You can use the default UUIDs or go to uuidgenerator.net to generate random UUIDs.
it_it: È possibile utilizzare gli UUID predefiniti o andare su uuidgenerator.net per generare UUID casuali.

source: You have just programmed your first ESP32!
it_it: È stato appena programmato il primo ESP32!

source: You might be wondering, “Wait a minute-how can a web server, which just serves web pages, actually control physical things like LEDs?”
it_it: Ci ci potrebbe chiedere, "Aspetta un attimo: come può un server web, che si limita a servire pagine web, controllare effettivamente cose fisiche come i LED?"

source: You might want to install python 3.8.x because it is the latest release supported by Windows 7.
it_it: Si consiglia di installare Python 3.8.x, poiché è l'ultima versione supportata da Windows 7.

source: You should make sure you always have the most recent version of the ESP32 Arduino core installed.
it_it: Assicurarsi di avere sempre installata la versione più recente del core ESP32 Arduino.

source: You should now see the “Done uploading” message.
it_it: Ora si dovrebbe vedere il messaggio “Done uploading” message.

source: You should see a clean and styled web page that displays the current temperature reading from the DS18B20 sensor.
it_it: Verrà visualizzata una pagina web pulita e ordinata che mostra la lettura della temperatura attuale del sensore DS18B20.

source: You should see a message saying: “The device started, now you can pair it with bluetooth!”.
it_it: Si dovrebbe vedere un messaggio che dice: “The device started, now you can pair it with bluetooth!”.

source: You should see a web page pop up!
it_it: Dovrebbe apparire una pagina web!

source: You should see the SSID, RSSI, WiFi channel, and encryption for each discovered network.
it_it: Si dovrebbero vedere SSID, RSSI, canale WiFi e crittografia per ogni rete rilevata.

source: You sit down, look over the menu, and tell the waiter what you’d like to eat.
it_it: Ci si siede, si da un'occhiata al menù e si dice al cameriere cosa si desidera mangiare.

source: You will see a selection of example sketches.
it_it: Si vedrà una selezione di sketch di esempio.

source: You won’t have to juggle or multiplex your IO pins.
it_it: Non ci si dovrà destreggiare tra i pin IO o multiplexarli.

source: You won’t have to juggle or multiplex...
it_it: Non ci si dovrà destreggiarsi o fare multiplexing...

source: Your browser immediately sends an HTTP request to the ESP32.
it_it: Il browser invia immediatamente una richiesta HTTP all'ESP32.

source: Your browser then takes that information and assembles it into a webpage you can view-allowing you to read text, watch videos, or interact with the content.
it_it: Il browser prende quindi queste informazioni e le assembla in una pagina web visualizzabile, consentendo di leggere testo, guardare video o interagire con i contenuti.

source: Your phone is acting like a mini-router.
it_it: Il telefono si comporta come un mini-router.

source: Your smartphone is now successfully paired with the ESP32 and ready to communicate.
it_it: Lo smartphone è ora associato correttamente all'ESP32 ed è pronto per comunicare.

source: You’ll also learn how to dynamically update the readings in real time using techniques like HTTP polling and AJAX.
it_it: Impareremo anche come aggiornare dinamicamente le letture in tempo reale utilizzando tecniche come il polling HTTP e AJAX.

source: You’ll also need a Bluetooth debugging application installed on it.
it_it: È inoltre necessaria un'applicazione di debug Bluetooth installata.

source: You’ll also see “HTTP server started” printed in the Serial Monitor.
it_it: Si vedrà anche la scritta “HTTP server started” sul Monitor Seriale.

source: You’ll have to repeat that button sequence every time you want to upload a new sketch.
it_it: Si dovrà ripetere la sequenza di tasti ogni volta che si vorrà caricare un nuovo sketch.

source: You’ll learn how to create a responsive web interface that lets you turn LEDs on and off from your browser, with the LED status instantly reflected on the page.
it_it: Impareremo a creare un'interfaccia web "responsive" che consente di accendere e spegnere i LED dal browser, con lo stato dei LED visualizzato istantaneamente sulla pagina.

source: You’ll learn what a web server is, how the ESP32 can operate in Station mode, Access Point mode, or both, and how to use these modes to build real-world applications.
it_it: Impareremo cos'è un server web, come l'ESP32 può funzionare in modalità Station, Access Point o entrambe, e come utilizzare queste modalità per creare applicazioni reali.

source: You’ll observe that not only does the on-board LED toggle, but the LED state automatically updates across all web browsers.
it_it: Si vedrà che non solo il LED integrato si attiva/disattiva, ma anche che lo stato del LED si aggiorna automaticamente su tutti i browser web.

source: You’ll probably have either CP2102 or CH340 populated on the board.
it_it: Probabilmente sulla scheda saranno presenti i driver CP2102 o CH340.

source: You’ll see that you can control both LEDs directly from your browser, all in real time.
it_it: Si vedrà che si possono controllare entrambi i LED direttamente dal browser, il tutto in tempo reale.

source: You’ll use these details to connect your other devices to the ESP32’s network.
it_it: Si userano questi dettagli per connettere gli altri dispositivi alla rete dell'ESP32.

source: You’ve seen how to handle the WebSocket connection on the client side (browser) up to this point.
it_it: Finora abbiamo visto come gestire la connessione WebSocket sul lato client (browser).

source: `Arduino Core for Espressif (Discord)`_: Official Espressif Discord channel for the Arduino Core.
it_it: `Arduino Core for Espressif (Discord)`_: Canale Discord ufficiale di Espressif per Arduino Core.

source: `Avahi <http://avahi.org/>`_ for Linux
it_it: `Avahi <http://avahi.org/>`_ per Linux

source: `Bonjour <http://www.apple.com/support/bonjour/>`_ for Windows
it_it: `Bonjour <http://www.apple.com/support/bonjour/>`_ per Windows

source: `ESP32 Forum - Arduino`_: Official Espressif Forum for Arduino related discussions.
it_it: `ESP32 Forum - Arduino`_: Forum ufficiale di Espressif per discussioni relative ad Arduino.

source: `ESP32 Forum - Hardware`_: Official Espressif Forum for Hardware related discussions.
it_it: `ESP32 Forum - Hardware`_: Forum ufficiale di Espressif per discussioni relative all'hardware.

source: `ESP32 Forum`_: Official Espressif Forum.
it_it: `ESP32 Forum`_: Forum Ufficiale di Espressif.

source: `ESP32 on Reddit`_
it_it: `ESP32 su Reddit`_

source: `ESP32-DevKitC`_ (Schematic)
it_it: `ESP32-DevKitC`_ (Schema)

source: `Espressif Developer Portal`_: Official Espressif Developer Portal with tutorials, examples, workshops, and more.
it_it: `Espressif Developer Portal`_: Portale ufficiale per sviluppatori Espressif con tutorial, esempi, workshop e altro ancora.

source: after deployment if user is unable to expose Firmware for OTA from external update server
it_it: dopo la distribuzione, se l'utente non è in grado di esporre il firmware per OTA da un server di aggiornamento esterno

source: board has three UART interfaces, UART0, UART1, and UART2, that support asynchronous communication (RS232 and RS485) and IrDA at up to 5 Mbps.
it_it: ha tre interfacce UART, UART0, UART1 e UART2, che supportano la comunicazione asincrona (RS232 e RS485) e IrDA fino a 5 Mbps.

source: board has two UART interfaces, UART0 and UART2, that support asynchronous communication (RS232 and RS485) and IrDA at up to 5 Mbps.
it_it: ha due interfacce UART, UART0 e UART2, che supportano la comunicazione asincrona (RS232 e RS485) e IrDA fino a 5 Mbps.

source: full quadrature decoding
it_it: decodifica "full quadrature"

source: index_html is the content to be sent, which is your HTML web page stored in the program memory.
it_it: index_html è il contenuto da inviare, ovvero la pagina web HTML memorizzata nella memoria del programma.

source: must be HIGH during boot
it_it: deve essere HIGH durante il boot

source: must be HIGH during boot and LOW for programming
it_it: deve essere HIGH durante il boot e LOW durante la programmazione

source: must be HIGH during boot, prevents startup log if pulled LOW
it_it: deve essere HIGH durante il boot, impedisce l'avvio del log se impostato su LOW

source: must be LOW during boot
it_it: deve essere LOW durante il boot

source: must be LOW during boot and also connected to the on-board LED
it_it: deve essere LOW durante l'avvio e collegato anche al LED integrato

source: onclose - Fired when a connection with a WebSocket is closed.
it_it: onclose - Attivato quando una connessione con un WebSocket viene chiusa.

source: onerror - Fired when a connection with a WebSocket has been closed because of an error, such as when some data couldn’t be sent.
it_it: onerror - Attivato quando una connessione con un WebSocket è stata chiusa a causa di un errore, ad esempio perché alcuni dati non sono stati inviati.

source: onmessage - Fired when the WebSocket receives data from the server.
it_it: onmessage - Attivato quando il WebSocket riceve dati dal server.

source: onopen - Fired when a connection with a WebSocket is established.
it_it: onopen - Attivato quando viene stabilita una connessione con un WebSocket.

source: open a `Git Bash` session pointing to ``[ARDUINO_SKETCHBOOK_DIR]/hardware/espressif/esp32`` and execute ```git submodule update --init --recursive```
it_it: aprire una sessione `Git Bash` che punti a ``[ARDUINO_SKETCHBOOK_DIR]/hardware/espressif/esp32`` ed eseguire ```git submodule update --init --recursive```

source: processor is a function that processes the HTML content before sending it (to replace placeholders, for example).
it_it: processor è una funzione che elabora il contenuto HTML prima di inviarlo (ad esempio per sostituire i segnaposto).

source: provide updates after deployment to small quantity of modules when setting an update server is not practicable
it_it: fornire aggiornamenti dopo la distribuzione a un numero limitato di moduli quando non è possibile impostare un server di aggiornamento

source: pulled up by 4.7k Ω
it_it: pulled up d 4.7k Ω

source: ~ PWM Pins The board has 25 channels (nearly all GPIO pins) of PWM pins controlled by a PWM controller.
it_it: ~ PWM Pin La scheda dispone di 25 canali (quasi tutti pin GPIO) di pin PWM controllati da un controller PWM.
